export const getEvents = () => ([
  {
    id: 1,
    name: 'Тренинг «Знакомство»',
    places: ['пр. Кронверкский, 49'],
    dates: ['2023-05-05T09:56:23+03:00', '2023-06-05T09:56:23+03:00', '2023-05-07T09:56:23+03:00'],
    signed: { place: 'пр. Кронверкский, 49', date: '2023-05-05T09:56:23+03:00' }
  }, {
    id: 2,
    name: 'Тренинг «Командообразование»',
    places: ['пр. Кронверкский, 49', 'улица Ломоносова, д. 9'],
    dates: ['2023-05-05T09:56:23+03:00', '2023-06-05T09:56:23+03:00', '2023-05-07T09:56:23+03:00'],
    signed: null
  }, {
    id: 3,
    name: 'Тренинг «Лидерство»',
    places: ['улица Ломоносова, д. 9'],
    dates: ['2023-05-05T09:56:23+03:00', '2023-06-05T09:56:23+03:00', '2023-05-07T09:56:23+03:00'],
    signed: null
  }
])

export const getEventsForAdmin = () => ([
  {
    id: 1,
    name: 'Тренинг «Знакомство»',
    places: ['пр. Кронверкский, 49'],
    dates: ['2023-05-05T09:56:23+03:00', '2023-06-05T09:56:23+03:00', '2023-05-07T09:56:23+03:00'],
    signed: [{
      isuNumber: 336757,
      name: 'Олейникова Полина',
      date: '2023-05-05T09:56:23+03:00',
      place: 'пр. Кронверкский, 49',
      visited: 0
    }]
  }, {
    id: 2,
    name: 'Тренинг «Командообразование»',
    places: ['пр. Кронверкский, 49', 'улица Ломоносова, д. 9'],
    dates: ['2023-05-05T09:56:23+03:00', '2023-06-05T09:56:23+03:00', '2023-05-07T09:56:23+03:00'],
    signed: []
  }
])
