export const getEventsByDates = () => ({
  '2023-05-15': [{
    id: 1,
    name: 'Тренинг «Знакомство»',
    places: ['пр. Кронверкский, 49'],
    dates: ['2023-05-15T09:56:23+03:00', '2023-05-22T09:56:23+03:00'],
    signed: { place: 'пр. Кронверкский, 49', date: '2023-05-05T09:56:23+03:00' }
  }],
  '2023-05-22': [{
    id: 1,
    name: 'Тренинг «Знакомство»',
    places: ['пр. Кронверкский, 49'],
    dates: ['2023-05-15T09:56:23+03:00', '2023-05-22T09:56:23+03:00'],
    signed: { place: 'пр. Кронверкский, 49', date: '2023-05-05T09:56:23+03:00' }
  }, {
    id: 2,
    name: 'Тренинг «Командообразование»',
    places: ['пр. Кронверкский, 49'],
    dates: ['2023-05-22T09:56:23+03:00', '2023-05-29T09:56:23+03:00', '2023-06-04T09:56:23+03:00'],
    signed: { place: 'пр. Кронверкский, 49', date: '2023-05-05T09:56:23+03:00' }
  }],
  '2023-05-29': [{
    id: 2,
    name: 'Тренинг «Командообразование»',
    places: ['пр. Кронверкский, 49'],
    dates: ['2023-05-22T09:56:23+03:00', '2023-05-29T09:56:23+03:00', '2023-06-04T09:56:23+03:00'],
    signed: null
  }]
})

export const getEventsByDatesAdmin = () => ({
  '2023-05-15': [{
    id: 1,
    name: 'Тренинг «Знакомство»',
    places: ['пр. Кронверкский, 49'],
    dates: ['2023-05-15T09:56:23+03:00', '2023-05-22T09:56:23+03:00'],
    signed: [{
      isuNumber: 336757,
      name: 'Олейникова Полина',
      date: '2023-05-05T09:56:23+03:00',
      place: 'пр. Кронверкский, 49',
      visited: 0
    }]
  }],
  '2023-05-22': [{
    id: 1,
    name: 'Тренинг «Знакомство»',
    places: ['пр. Кронверкский, 49'],
    dates: ['2023-05-15T09:56:23+03:00', '2023-05-22T09:56:23+03:00'],
    signed: []
  }, {
    id: 2,
    name: 'Тренинг «Командообразование»',
    places: ['пр. Кронверкский, 49'],
    dates: ['2023-05-22T09:56:23+03:00', '2023-05-29T09:56:23+03:00', '2023-06-04T09:56:23+03:00'],
    signed: []
  }],
  '2023-05-29': [{
    id: 1,
    name: 'Тренинг «Командообразование»',
    places: ['пр. Кронверкский, 49'],
    dates: ['2023-05-22T09:56:23+03:00', '2023-05-29T09:56:23+03:00', '2023-06-04T09:56:23+03:00'],
    signed: []
  }]
})
