export const getEventsByDates = () => ({
  '2023-05-05': [{
    id: 1,
    name: 'Тренинг «Знакомство»',
    places: ['пр. Кронверкский, 49'],
    dates: ['2023-05-05T09:56:23+03:00', '2023-06-05T09:56:23+03:00', '2023-05-07T09:56:23+03:00'],
    signed: { place: 'пр. Кронверкский, 49', date: '2023-05-05T09:56:23+03:00' }
  }, {
    id: 2,
    name: 'Тренинг «Знакомство2»',
    places: ['пр. Кронверкский, 49'],
    dates: ['2023-05-05T09:56:23+03:00', '2023-06-05T09:56:23+03:00', '2023-05-07T09:56:23+03:00'],
    signed: null
  }],
  '2023-05-07': [{
    id: 1,
    name: 'Тренинг «Знакомство»',
    places: ['пр. Кронверкский, 49'],
    dates: ['2023-05-05T09:56:23+03:00', '2023-06-05T09:56:23+03:00', '2023-05-07T09:56:23+03:00'],
    signed: { place: 'пр. Кронверкский, 49', date: '2023-05-05T09:56:23+03:00' }
  }]
})
